layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 32
    mean_file: "./mean"
  }
  data_param {
    source: "./train"
    batch_size: 128
    backend: LMDB
  }
  image_data_param {
    shuffle: true
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 32
    mean_file: "./mean"
  }
  data_param {
    source: "./test"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "conv_start"
  type: "Convolution"
  bottom: "data"
  top: "conv_start"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_1_bn_pre"
  type: "BatchNorm"
  bottom: "conv_start"
  top: "conv_start"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_1_bn_pre"
  type: "BatchNorm"
  bottom: "conv_start"
  top: "conv_start"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_1_pre_scale"
  type: "Scale"
  bottom: "conv_start"
  top: "conv_start"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_1_pre_relu"
  type: "ReLU"
  bottom: "conv_start"
  top: "conv_start"
}
layer {
  name: "map16_1_conv1"
  type: "Convolution"
  bottom: "conv_start"
  top: "map16_1_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_1_bn1"
  type: "BatchNorm"
  bottom: "map16_1_conv1"
  top: "map16_1_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_1_bn1"
  type: "BatchNorm"
  bottom: "map16_1_conv1"
  top: "map16_1_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_1_scale1"
  type: "Scale"
  bottom: "map16_1_conv1"
  top: "map16_1_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_1_relu1"
  type: "ReLU"
  bottom: "map16_1_conv1"
  top: "map16_1_conv1"
}
layer {
  name: "map16_1_conv2"
  type: "Convolution"
  bottom: "map16_1_conv1"
  top: "map16_1_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_1_bn2"
  type: "BatchNorm"
  bottom: "map16_1_conv2"
  top: "map16_1_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_1_bn2"
  type: "BatchNorm"
  bottom: "map16_1_conv2"
  top: "map16_1_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_1_scale2"
  type: "Scale"
  bottom: "map16_1_conv2"
  top: "map16_1_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_1_relu2"
  type: "ReLU"
  bottom: "map16_1_conv2"
  top: "map16_1_conv2"
}
layer {
  name: "map16_1_conv_end"
  type: "Convolution"
  bottom: "map16_1_conv2"
  top: "map16_1_conv_end"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Convolution1"
  type: "Convolution"
  bottom: "conv_start"
  top: "Convolution1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_1_eltsum"
  type: "Eltwise"
  bottom: "Convolution1"
  bottom: "map16_1_conv_end"
  top: "map16_1_eltsum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "map16_2_bn_pre"
  type: "BatchNorm"
  bottom: "map16_1_eltsum"
  top: "map16_2_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_2_bn_pre"
  type: "BatchNorm"
  bottom: "map16_1_eltsum"
  top: "map16_2_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_2_pre_scale"
  type: "Scale"
  bottom: "map16_2_bn_pre"
  top: "map16_2_bn_pre"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_2_pre_relu"
  type: "ReLU"
  bottom: "map16_2_bn_pre"
  top: "map16_2_bn_pre"
}
layer {
  name: "map16_2_conv1"
  type: "Convolution"
  bottom: "map16_2_bn_pre"
  top: "map16_2_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_2_bn1"
  type: "BatchNorm"
  bottom: "map16_2_conv1"
  top: "map16_2_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_2_bn1"
  type: "BatchNorm"
  bottom: "map16_2_conv1"
  top: "map16_2_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_2_scale1"
  type: "Scale"
  bottom: "map16_2_conv1"
  top: "map16_2_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_2_relu1"
  type: "ReLU"
  bottom: "map16_2_conv1"
  top: "map16_2_conv1"
}
layer {
  name: "map16_2_conv2"
  type: "Convolution"
  bottom: "map16_2_conv1"
  top: "map16_2_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_2_bn2"
  type: "BatchNorm"
  bottom: "map16_2_conv2"
  top: "map16_2_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_2_bn2"
  type: "BatchNorm"
  bottom: "map16_2_conv2"
  top: "map16_2_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_2_scale2"
  type: "Scale"
  bottom: "map16_2_conv2"
  top: "map16_2_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_2_relu2"
  type: "ReLU"
  bottom: "map16_2_conv2"
  top: "map16_2_conv2"
}
layer {
  name: "map16_2_conv_end"
  type: "Convolution"
  bottom: "map16_2_conv2"
  top: "map16_2_conv_end"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_2_eltsum"
  type: "Eltwise"
  bottom: "map16_1_eltsum"
  bottom: "map16_2_conv_end"
  top: "map16_2_eltsum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "map16_3_bn_pre"
  type: "BatchNorm"
  bottom: "map16_2_eltsum"
  top: "map16_3_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_3_bn_pre"
  type: "BatchNorm"
  bottom: "map16_2_eltsum"
  top: "map16_3_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_3_pre_scale"
  type: "Scale"
  bottom: "map16_3_bn_pre"
  top: "map16_3_bn_pre"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_3_pre_relu"
  type: "ReLU"
  bottom: "map16_3_bn_pre"
  top: "map16_3_bn_pre"
}
layer {
  name: "map16_3_conv1"
  type: "Convolution"
  bottom: "map16_3_bn_pre"
  top: "map16_3_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_3_bn1"
  type: "BatchNorm"
  bottom: "map16_3_conv1"
  top: "map16_3_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_3_bn1"
  type: "BatchNorm"
  bottom: "map16_3_conv1"
  top: "map16_3_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_3_scale1"
  type: "Scale"
  bottom: "map16_3_conv1"
  top: "map16_3_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_3_relu1"
  type: "ReLU"
  bottom: "map16_3_conv1"
  top: "map16_3_conv1"
}
layer {
  name: "map16_3_conv2"
  type: "Convolution"
  bottom: "map16_3_conv1"
  top: "map16_3_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_3_bn2"
  type: "BatchNorm"
  bottom: "map16_3_conv2"
  top: "map16_3_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_3_bn2"
  type: "BatchNorm"
  bottom: "map16_3_conv2"
  top: "map16_3_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_3_scale2"
  type: "Scale"
  bottom: "map16_3_conv2"
  top: "map16_3_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_3_relu2"
  type: "ReLU"
  bottom: "map16_3_conv2"
  top: "map16_3_conv2"
}
layer {
  name: "map16_3_conv_end"
  type: "Convolution"
  bottom: "map16_3_conv2"
  top: "map16_3_conv_end"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_3_eltsum"
  type: "Eltwise"
  bottom: "map16_2_eltsum"
  bottom: "map16_3_conv_end"
  top: "map16_3_eltsum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "map16_4_bn_pre"
  type: "BatchNorm"
  bottom: "map16_3_eltsum"
  top: "map16_4_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_4_bn_pre"
  type: "BatchNorm"
  bottom: "map16_3_eltsum"
  top: "map16_4_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_4_pre_scale"
  type: "Scale"
  bottom: "map16_4_bn_pre"
  top: "map16_4_bn_pre"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_4_pre_relu"
  type: "ReLU"
  bottom: "map16_4_bn_pre"
  top: "map16_4_bn_pre"
}
layer {
  name: "map16_4_conv1"
  type: "Convolution"
  bottom: "map16_4_bn_pre"
  top: "map16_4_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_4_bn1"
  type: "BatchNorm"
  bottom: "map16_4_conv1"
  top: "map16_4_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_4_bn1"
  type: "BatchNorm"
  bottom: "map16_4_conv1"
  top: "map16_4_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_4_scale1"
  type: "Scale"
  bottom: "map16_4_conv1"
  top: "map16_4_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_4_relu1"
  type: "ReLU"
  bottom: "map16_4_conv1"
  top: "map16_4_conv1"
}
layer {
  name: "map16_4_conv2"
  type: "Convolution"
  bottom: "map16_4_conv1"
  top: "map16_4_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_4_bn2"
  type: "BatchNorm"
  bottom: "map16_4_conv2"
  top: "map16_4_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_4_bn2"
  type: "BatchNorm"
  bottom: "map16_4_conv2"
  top: "map16_4_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_4_scale2"
  type: "Scale"
  bottom: "map16_4_conv2"
  top: "map16_4_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_4_relu2"
  type: "ReLU"
  bottom: "map16_4_conv2"
  top: "map16_4_conv2"
}
layer {
  name: "map16_4_conv_end"
  type: "Convolution"
  bottom: "map16_4_conv2"
  top: "map16_4_conv_end"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_4_eltsum"
  type: "Eltwise"
  bottom: "map16_3_eltsum"
  bottom: "map16_4_conv_end"
  top: "map16_4_eltsum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "map16_5_bn_pre"
  type: "BatchNorm"
  bottom: "map16_4_eltsum"
  top: "map16_5_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_5_bn_pre"
  type: "BatchNorm"
  bottom: "map16_4_eltsum"
  top: "map16_5_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_5_pre_scale"
  type: "Scale"
  bottom: "map16_5_bn_pre"
  top: "map16_5_bn_pre"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_5_pre_relu"
  type: "ReLU"
  bottom: "map16_5_bn_pre"
  top: "map16_5_bn_pre"
}
layer {
  name: "map16_5_conv1"
  type: "Convolution"
  bottom: "map16_5_bn_pre"
  top: "map16_5_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_5_bn1"
  type: "BatchNorm"
  bottom: "map16_5_conv1"
  top: "map16_5_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_5_bn1"
  type: "BatchNorm"
  bottom: "map16_5_conv1"
  top: "map16_5_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_5_scale1"
  type: "Scale"
  bottom: "map16_5_conv1"
  top: "map16_5_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_5_relu1"
  type: "ReLU"
  bottom: "map16_5_conv1"
  top: "map16_5_conv1"
}
layer {
  name: "map16_5_conv2"
  type: "Convolution"
  bottom: "map16_5_conv1"
  top: "map16_5_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_5_bn2"
  type: "BatchNorm"
  bottom: "map16_5_conv2"
  top: "map16_5_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_5_bn2"
  type: "BatchNorm"
  bottom: "map16_5_conv2"
  top: "map16_5_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_5_scale2"
  type: "Scale"
  bottom: "map16_5_conv2"
  top: "map16_5_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_5_relu2"
  type: "ReLU"
  bottom: "map16_5_conv2"
  top: "map16_5_conv2"
}
layer {
  name: "map16_5_conv_end"
  type: "Convolution"
  bottom: "map16_5_conv2"
  top: "map16_5_conv_end"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_5_eltsum"
  type: "Eltwise"
  bottom: "map16_4_eltsum"
  bottom: "map16_5_conv_end"
  top: "map16_5_eltsum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "map16_6_bn_pre"
  type: "BatchNorm"
  bottom: "map16_5_eltsum"
  top: "map16_6_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_6_bn_pre"
  type: "BatchNorm"
  bottom: "map16_5_eltsum"
  top: "map16_6_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_6_pre_scale"
  type: "Scale"
  bottom: "map16_6_bn_pre"
  top: "map16_6_bn_pre"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_6_pre_relu"
  type: "ReLU"
  bottom: "map16_6_bn_pre"
  top: "map16_6_bn_pre"
}
layer {
  name: "map16_6_conv1"
  type: "Convolution"
  bottom: "map16_6_bn_pre"
  top: "map16_6_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_6_bn1"
  type: "BatchNorm"
  bottom: "map16_6_conv1"
  top: "map16_6_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_6_bn1"
  type: "BatchNorm"
  bottom: "map16_6_conv1"
  top: "map16_6_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_6_scale1"
  type: "Scale"
  bottom: "map16_6_conv1"
  top: "map16_6_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_6_relu1"
  type: "ReLU"
  bottom: "map16_6_conv1"
  top: "map16_6_conv1"
}
layer {
  name: "map16_6_conv2"
  type: "Convolution"
  bottom: "map16_6_conv1"
  top: "map16_6_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_6_bn2"
  type: "BatchNorm"
  bottom: "map16_6_conv2"
  top: "map16_6_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_6_bn2"
  type: "BatchNorm"
  bottom: "map16_6_conv2"
  top: "map16_6_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_6_scale2"
  type: "Scale"
  bottom: "map16_6_conv2"
  top: "map16_6_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_6_relu2"
  type: "ReLU"
  bottom: "map16_6_conv2"
  top: "map16_6_conv2"
}
layer {
  name: "map16_6_conv_end"
  type: "Convolution"
  bottom: "map16_6_conv2"
  top: "map16_6_conv_end"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_6_eltsum"
  type: "Eltwise"
  bottom: "map16_5_eltsum"
  bottom: "map16_6_conv_end"
  top: "map16_6_eltsum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "map16_7_bn_pre"
  type: "BatchNorm"
  bottom: "map16_6_eltsum"
  top: "map16_7_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_7_bn_pre"
  type: "BatchNorm"
  bottom: "map16_6_eltsum"
  top: "map16_7_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_7_pre_scale"
  type: "Scale"
  bottom: "map16_7_bn_pre"
  top: "map16_7_bn_pre"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_7_pre_relu"
  type: "ReLU"
  bottom: "map16_7_bn_pre"
  top: "map16_7_bn_pre"
}
layer {
  name: "map16_7_conv1"
  type: "Convolution"
  bottom: "map16_7_bn_pre"
  top: "map16_7_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_7_bn1"
  type: "BatchNorm"
  bottom: "map16_7_conv1"
  top: "map16_7_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_7_bn1"
  type: "BatchNorm"
  bottom: "map16_7_conv1"
  top: "map16_7_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_7_scale1"
  type: "Scale"
  bottom: "map16_7_conv1"
  top: "map16_7_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_7_relu1"
  type: "ReLU"
  bottom: "map16_7_conv1"
  top: "map16_7_conv1"
}
layer {
  name: "map16_7_conv2"
  type: "Convolution"
  bottom: "map16_7_conv1"
  top: "map16_7_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_7_bn2"
  type: "BatchNorm"
  bottom: "map16_7_conv2"
  top: "map16_7_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_7_bn2"
  type: "BatchNorm"
  bottom: "map16_7_conv2"
  top: "map16_7_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_7_scale2"
  type: "Scale"
  bottom: "map16_7_conv2"
  top: "map16_7_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_7_relu2"
  type: "ReLU"
  bottom: "map16_7_conv2"
  top: "map16_7_conv2"
}
layer {
  name: "map16_7_conv_end"
  type: "Convolution"
  bottom: "map16_7_conv2"
  top: "map16_7_conv_end"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_7_eltsum"
  type: "Eltwise"
  bottom: "map16_6_eltsum"
  bottom: "map16_7_conv_end"
  top: "map16_7_eltsum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "map16_8_bn_pre"
  type: "BatchNorm"
  bottom: "map16_7_eltsum"
  top: "map16_8_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_8_bn_pre"
  type: "BatchNorm"
  bottom: "map16_7_eltsum"
  top: "map16_8_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_8_pre_scale"
  type: "Scale"
  bottom: "map16_8_bn_pre"
  top: "map16_8_bn_pre"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_8_pre_relu"
  type: "ReLU"
  bottom: "map16_8_bn_pre"
  top: "map16_8_bn_pre"
}
layer {
  name: "map16_8_conv1"
  type: "Convolution"
  bottom: "map16_8_bn_pre"
  top: "map16_8_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_8_bn1"
  type: "BatchNorm"
  bottom: "map16_8_conv1"
  top: "map16_8_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_8_bn1"
  type: "BatchNorm"
  bottom: "map16_8_conv1"
  top: "map16_8_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_8_scale1"
  type: "Scale"
  bottom: "map16_8_conv1"
  top: "map16_8_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_8_relu1"
  type: "ReLU"
  bottom: "map16_8_conv1"
  top: "map16_8_conv1"
}
layer {
  name: "map16_8_conv2"
  type: "Convolution"
  bottom: "map16_8_conv1"
  top: "map16_8_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_8_bn2"
  type: "BatchNorm"
  bottom: "map16_8_conv2"
  top: "map16_8_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_8_bn2"
  type: "BatchNorm"
  bottom: "map16_8_conv2"
  top: "map16_8_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_8_scale2"
  type: "Scale"
  bottom: "map16_8_conv2"
  top: "map16_8_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_8_relu2"
  type: "ReLU"
  bottom: "map16_8_conv2"
  top: "map16_8_conv2"
}
layer {
  name: "map16_8_conv_end"
  type: "Convolution"
  bottom: "map16_8_conv2"
  top: "map16_8_conv_end"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_8_eltsum"
  type: "Eltwise"
  bottom: "map16_7_eltsum"
  bottom: "map16_8_conv_end"
  top: "map16_8_eltsum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "map16_9_bn_pre"
  type: "BatchNorm"
  bottom: "map16_8_eltsum"
  top: "map16_9_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_9_bn_pre"
  type: "BatchNorm"
  bottom: "map16_8_eltsum"
  top: "map16_9_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_9_pre_scale"
  type: "Scale"
  bottom: "map16_9_bn_pre"
  top: "map16_9_bn_pre"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_9_pre_relu"
  type: "ReLU"
  bottom: "map16_9_bn_pre"
  top: "map16_9_bn_pre"
}
layer {
  name: "map16_9_conv1"
  type: "Convolution"
  bottom: "map16_9_bn_pre"
  top: "map16_9_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_9_bn1"
  type: "BatchNorm"
  bottom: "map16_9_conv1"
  top: "map16_9_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_9_bn1"
  type: "BatchNorm"
  bottom: "map16_9_conv1"
  top: "map16_9_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_9_scale1"
  type: "Scale"
  bottom: "map16_9_conv1"
  top: "map16_9_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_9_relu1"
  type: "ReLU"
  bottom: "map16_9_conv1"
  top: "map16_9_conv1"
}
layer {
  name: "map16_9_conv2"
  type: "Convolution"
  bottom: "map16_9_conv1"
  top: "map16_9_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_9_bn2"
  type: "BatchNorm"
  bottom: "map16_9_conv2"
  top: "map16_9_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_9_bn2"
  type: "BatchNorm"
  bottom: "map16_9_conv2"
  top: "map16_9_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_9_scale2"
  type: "Scale"
  bottom: "map16_9_conv2"
  top: "map16_9_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_9_relu2"
  type: "ReLU"
  bottom: "map16_9_conv2"
  top: "map16_9_conv2"
}
layer {
  name: "map16_9_conv_end"
  type: "Convolution"
  bottom: "map16_9_conv2"
  top: "map16_9_conv_end"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_9_eltsum"
  type: "Eltwise"
  bottom: "map16_8_eltsum"
  bottom: "map16_9_conv_end"
  top: "map16_9_eltsum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "map16_10_bn_pre"
  type: "BatchNorm"
  bottom: "map16_9_eltsum"
  top: "map16_10_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_10_bn_pre"
  type: "BatchNorm"
  bottom: "map16_9_eltsum"
  top: "map16_10_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_10_pre_scale"
  type: "Scale"
  bottom: "map16_10_bn_pre"
  top: "map16_10_bn_pre"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_10_pre_relu"
  type: "ReLU"
  bottom: "map16_10_bn_pre"
  top: "map16_10_bn_pre"
}
layer {
  name: "map16_10_conv1"
  type: "Convolution"
  bottom: "map16_10_bn_pre"
  top: "map16_10_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_10_bn1"
  type: "BatchNorm"
  bottom: "map16_10_conv1"
  top: "map16_10_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_10_bn1"
  type: "BatchNorm"
  bottom: "map16_10_conv1"
  top: "map16_10_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_10_scale1"
  type: "Scale"
  bottom: "map16_10_conv1"
  top: "map16_10_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_10_relu1"
  type: "ReLU"
  bottom: "map16_10_conv1"
  top: "map16_10_conv1"
}
layer {
  name: "map16_10_conv2"
  type: "Convolution"
  bottom: "map16_10_conv1"
  top: "map16_10_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_10_bn2"
  type: "BatchNorm"
  bottom: "map16_10_conv2"
  top: "map16_10_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_10_bn2"
  type: "BatchNorm"
  bottom: "map16_10_conv2"
  top: "map16_10_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_10_scale2"
  type: "Scale"
  bottom: "map16_10_conv2"
  top: "map16_10_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_10_relu2"
  type: "ReLU"
  bottom: "map16_10_conv2"
  top: "map16_10_conv2"
}
layer {
  name: "map16_10_conv_end"
  type: "Convolution"
  bottom: "map16_10_conv2"
  top: "map16_10_conv_end"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_10_eltsum"
  type: "Eltwise"
  bottom: "map16_9_eltsum"
  bottom: "map16_10_conv_end"
  top: "map16_10_eltsum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "map16_11_bn_pre"
  type: "BatchNorm"
  bottom: "map16_10_eltsum"
  top: "map16_11_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_11_bn_pre"
  type: "BatchNorm"
  bottom: "map16_10_eltsum"
  top: "map16_11_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_11_pre_scale"
  type: "Scale"
  bottom: "map16_11_bn_pre"
  top: "map16_11_bn_pre"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_11_pre_relu"
  type: "ReLU"
  bottom: "map16_11_bn_pre"
  top: "map16_11_bn_pre"
}
layer {
  name: "map16_11_conv1"
  type: "Convolution"
  bottom: "map16_11_bn_pre"
  top: "map16_11_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_11_bn1"
  type: "BatchNorm"
  bottom: "map16_11_conv1"
  top: "map16_11_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_11_bn1"
  type: "BatchNorm"
  bottom: "map16_11_conv1"
  top: "map16_11_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_11_scale1"
  type: "Scale"
  bottom: "map16_11_conv1"
  top: "map16_11_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_11_relu1"
  type: "ReLU"
  bottom: "map16_11_conv1"
  top: "map16_11_conv1"
}
layer {
  name: "map16_11_conv2"
  type: "Convolution"
  bottom: "map16_11_conv1"
  top: "map16_11_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_11_bn2"
  type: "BatchNorm"
  bottom: "map16_11_conv2"
  top: "map16_11_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_11_bn2"
  type: "BatchNorm"
  bottom: "map16_11_conv2"
  top: "map16_11_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_11_scale2"
  type: "Scale"
  bottom: "map16_11_conv2"
  top: "map16_11_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_11_relu2"
  type: "ReLU"
  bottom: "map16_11_conv2"
  top: "map16_11_conv2"
}
layer {
  name: "map16_11_conv_end"
  type: "Convolution"
  bottom: "map16_11_conv2"
  top: "map16_11_conv_end"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_11_eltsum"
  type: "Eltwise"
  bottom: "map16_10_eltsum"
  bottom: "map16_11_conv_end"
  top: "map16_11_eltsum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "map16_12_bn_pre"
  type: "BatchNorm"
  bottom: "map16_11_eltsum"
  top: "map16_12_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_12_bn_pre"
  type: "BatchNorm"
  bottom: "map16_11_eltsum"
  top: "map16_12_bn_pre"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_12_pre_scale"
  type: "Scale"
  bottom: "map16_12_bn_pre"
  top: "map16_12_bn_pre"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_12_pre_relu"
  type: "ReLU"
  bottom: "map16_12_bn_pre"
  top: "map16_12_bn_pre"
}
layer {
  name: "map16_12_conv1"
  type: "Convolution"
  bottom: "map16_12_bn_pre"
  top: "map16_12_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_12_bn1"
  type: "BatchNorm"
  bottom: "map16_12_conv1"
  top: "map16_12_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_12_bn1"
  type: "BatchNorm"
  bottom: "map16_12_conv1"
  top: "map16_12_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_12_scale1"
  type: "Scale"
  bottom: "map16_12_conv1"
  top: "map16_12_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_12_relu1"
  type: "ReLU"
  bottom: "map16_12_conv1"
  top: "map16_12_conv1"
}
layer {
  name: "map16_12_conv2"
  type: "Convolution"
  bottom: "map16_12_conv1"
  top: "map16_12_conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "map16_12_bn2"
  type: "BatchNorm"
  bottom: "map16_12_conv2"
  top: "map16_12_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TRAIN
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "map16_12_bn2"
  type: "BatchNorm"
  bottom: "map16_12_conv2"
  top: "map16_12_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  include {
    phase: TEST
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "map16_12_scale2"
  type: "Scale"
  bottom: "map16_12_conv2"
  top: "map16_12_conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "map16_12_relu2"
  type: "ReLU"
  bottom: "map16_12_conv2"
  top: "map16_12_conv2"
}
layer {
  name: "map16_12_conv_end"
  type: "Convolution"
  bottom: "map16_12_conv2"
  top: "map16_12_conv_end"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
